БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ИсходыТиповЗвонковДопустимые/ИсходыТиповЗвонковДопустимые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсходыТиповЗвонковДопустимые</name>
  <dimensions>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НеотработанныеОбращения/НеотработанныеОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НеотработанныеОбращения</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЛистОжидания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Признак значения по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <comment>Вспомогательное поле: &quot;Код страны&quot; или &quot;Индекс&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <comment>Вспомогательное поле: &quot;Код города&quot; или &quot;Регион&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <comment>Вспомогательное поле: &quot;Номер телефона&quot; или &quot;Район&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <comment>Вспомогательное поле: &quot;Внутренний (или добавочный)  номер&quot; или &quot;Город&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <comment>Вспомогательное поле: &quot;Населенный пункт&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <comment>Вспомогательное поле: &quot;Улица&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <comment>Вспомогательное поле: &quot;Дом&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <comment>Вспомогательное поле: &quot;Корпус&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <comment>Вспомогательное поле: &quot;Квартира&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Строковое представление контактной информации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <comment>Вспомогательное поле: &quot;Подъезд&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле11</name>
    <comment>Вспомогательное поле: &quot;Этаж&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле12</name>
    <comment>Вспомогательное поле: &quot;Код двери/домофон&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец контактной информации</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид контактной информации</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыСобытий/ВидыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытий</name>
  <enumValues>
    <name>ВходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееПисьмо</name>
  </enumValues>
  <enumValues>
    <name>ВходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ИсходящийЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ЛичнаяВстреча</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ИсходыЗвонка/ИсходыЗвонка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходыЗвонка</name>
  <predefined>
    <items>
      <name>ЗаписанНаПрием</name>
      <description>Записан на прием</description>
    </items>
  </predefined>
  <attributes>
    <name>СоздаватьЛистОжидания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщениеСостоялось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЛид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/Событие/Forms/ФормаДокумента/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем ТелефоныКлиента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	ИспользоватьCallЦентр = Метаданные.ФункциональныеОпции.Найти("ИспользоватьCallЦентр") <> Неопределено И ПолучитьФункциональнуюОпцию("ИспользоватьCallЦентр");
	
	ЭтоНовый = Объект.Ссылка.Пустая();	
	Если ЭтоНовый Тогда
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда 
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Основание.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Основание);
	
	ДопСвойства = Новый Структура;
	Если Не ЗначениеЗаполнено(Объект.Клиент)
		И ЗначениеЗаполнено(Объект.Основание)
		И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистОжидания")
		И ЗначениеЗаполнено(Объект.Основание.Клиент)
		И ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные())
	Тогда 
		Объект.Клиент = Объект.Основание.Клиент;
		Модифицированность = Истина;
		ДопСвойства.Вставить("АвтоподстановкаКлиентаИзОснования", Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИсходыТиповЗвонков = РегистрыСведений.ИсходыТиповЗвонковДопустимые.СоздатьНаборЗаписей();
	ИсходыТиповЗвонков.Прочитать();
	ИсходыПоТипуЗвонка.Загрузить(ИсходыТиповЗвонков.Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЗвонков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипыЗвонков КАК ТипыЗвонков
		|ГДЕ
		|	ТипыЗвонков.ИсходОбязателен = ИСТИНА";
	
	ТипыЗвонкаСОбязательнымИсходом.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Элементы.Дата.Доступность = РольДоступна("ПолныеПрава") Или РольДоступна("бит_ПользовательБИТфон");
	
	ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	НомерКартинкиВидаСобытия = ОбщегоНазначенияПереопределяемый.ПолучитьИндексЭлементаПеречисления(Объект.ВидСобытия);
	НастроитьВидимостьДоступность();
	
	ОбновитьПодсказкуНомераТелефона();
	
	Если ДопСвойства.Свойство("АвтоподстановкаКлиентаИзОснования") И ДопСвойства.АвтоподстановкаКлиентаИзОснования Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Была выполнена автоподстановка Клиента из основания текущего События'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЛистОжидания")
		И Не ЗавершениеРаботы
		И ОтсутствуютЛистыОжиданияВведенныеНаОсновании(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ИсходЗвонка) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсходЗвонка, "СоздаватьЛистОжидания")
	Тогда
		ЗначенияЗаполнения = CRMСервер.ПолучитьЗначенияЗаполненияДляЛистаОжиданияПоОбъекту(Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Клиент, ЗначенияЗаполнения, ДатаНачала", Объект.Клиент, ЗначенияЗаполнения, ТекущаяДата());
		ОткрытьФорму("Документ.ЛистОжидания.Форма.ФормаБыстрогоСоздания", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ТипЗвонка.ИсходОбязателен И Не ЗначениеЗаполнено(ТекущийОбъект.ИсходЗвонка) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен исход звонка'"),,"Объект.ИсходЗвонка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ДатаПлан) И Не ЗначениеЗаполнено(ТекущийОбъект.ДатаФакт) Тогда 
		ТекущийОбъект.ДатаФакт = ТекущийОбъект.Дата;
		
		Если Не ЗначениеЗаполнено(ТекущийОбъект.ФактическийИсполнитель) Тогда
			ТекущийОбъект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.ВидСобытия = Перечисления.ВидыСобытий.ВходящееПисьмо Или
		ТекущийОбъект.ВидСобытия = Перечисления.ВидыСобытий.ВходящийЗвонок 
	Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.ПлановыйИсполнитель) Тогда
		    ТекущийОбъект.ПлановыйИсполнитель = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущийОбъект.ДатаПлан) Тогда
		    ТекущийОбъект.ДатаПлан = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновитьСотовыйКлиента И ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновитьСотовыйКлиента", Истина);
		ДопСвойства.Удалить("ОбновитьСотовыйКлиента");
		ОбновитьСотовыйКлиента = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Ложь, ЭтаФорма);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Основание)
		И ТипЗнч(ТекущийОбъект.Основание) = Тип("ДокументСсылка.ЛистОжидания")
	Тогда
		
		Если ЗначениеЗаполнено(ТекущийОбъект.Клиент)
			И НЕ ЗначениеЗаполнено(ТекущийОбъект.Основание.Клиент)
		Тогда
			УстановитьПривилегированныйРежим(Истина);
			ЛистОжидания = Объект.Основание.ПолучитьОбъект();
			ЛистОжидания.Клиент = ТекущийОбъект.Клиент;
			Попытка
				ЛистОжидания.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось сохранить Клиента в основании События.'"));
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Если ТекущийОбъект.ИсходЗвонка.ОбщениеСостоялось Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			НаборЗаписей = РегистрыСведений.НеотработанныеОбращения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Основание);
			НаборЗаписей.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БитФон_ЗаписьНомераТелефонаКонтрагента" Тогда
		Если Не ЗначениеЗаполнено(Объект.Клиент) И Объект.НомерТелефона = Параметр Тогда 
			Объект.Клиент = Источник;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗаявкаПоДокументуЗапись"
		И Параметр.ДокументЗаписи = Объект.Ссылка 
		И Не Объект.Ссылка.Пустая()
	Тогда
		Если Не ЗначениеЗаполнено(Объект.ИсходЗвонка) Тогда
			Объект.ИсходЗвонка = ПредопределенноеЗначение("Справочник.ИсходыЗвонка.ЗаписанНаПрием");
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Результат = "";
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Объект.Клиент = ВыбранноеЗначение;
			ОбновитьПодсказкуНомераТелефона();
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
			И ВыбранноеЗначение.Свойство("Клиент")
			И ЗначениеЗаполнено(ВыбранноеЗначение.Клиент)
	Тогда
		Объект.Клиент = ВыбранноеЗначение.Клиент;
		ОбновитьПодсказкуНомераТелефона();
	КонецЕсли;
	
	Если Не ПустаяСтрока(Результат) Тогда 
		Предупреждение(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок")
		Или Не ЗначениеЗаполнено(Объект.НомерТелефона)
	Тогда
		Объект.НомерТелефона = ?(ЗначениеЗаполнено(Объект.Клиент), ПолучитьНомерАвтоподстановки(), "");
	КонецЕсли;
	ОбновитьПодсказкуНомераТелефона();
	ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	
	ОбновитьСотовыйКлиента = ЗначениеЗаполнено(Объект.Клиент) И ДопСвойства.Свойство("ОбновитьСотовыйКлиента"); // Для возможного автосохранения телефона клиенту.
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	НомерКартинкиВидаСобытия = ОбщегоНазначенияПереопределяемый.ПолучитьИндексЭлементаПеречисления(Объект.ВидСобытия);
	НастроитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

// Команды

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаФактТекущая(Команда)
	
	Объект.ДатаФакт = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(Объект.ФактическийИсполнитель) Тогда
		Объект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	ФормаКлиента = ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);
	ФормаКлиента.Телефон = бит_ТелефонияКлиентСервер.СократитьНомерДляПоиска(бит_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(Объект.НомерТелефона));
	ФормаКлиента.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТелефон(Команда)
	
	Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
	ОбновитьПодсказкуНомераТелефона();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТелефон(Команда)
	
	СотовыйЕсть = ЕстьСотовыйТелефонУКлиента(Объект.Клиент);
	Если СотовыйЕсть Тогда
		ПараметрыФормы = Новый Структура("Клиент, Номер", Объект.Клиент, Объект.НомерТелефона);
		ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));
	Иначе
		КонтактнаяИнформацияСерверПереопределяемый.ЗаписатьНомерТелефона(Объект.Клиент, Объект.НомерТелефона);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьРазговор(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Нет данных для совершения звонка. Не заполнен клиент или не указан контактный телефон!'");
	Если Не ЗначениеЗаполнено(Объект.НомерТелефона) Тогда
		Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
		ОбновитьПодсказкуНомераТелефона();
		Если Не ЗначениеЗаполнено(Объект.НомерТелефона) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если Команда.Имя = "НачатьРазговор" Тогда  
		бит_ТелефонияКлиентПереопределяемый.Позвонить(Объект.НомерТелефона, Объект.Ссылка);
	Иначе
		бит_ТелефонияКлиентПереопределяемый.ПозвонитьМонитор(Объект.НомерТелефона, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомментарийКлиента(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
	    ПараметрыФормы = Новый Структура("Клиент", Объект.Клиент);
    	ОткрытьФорму("Отчет.КалендарьПланирования.Форма.ФормаКомментарииКлиента",ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПоказатьКомментарииКлиентаПослеИзменения", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекПользователяКакПлан(Команда)
	
	Если Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящееПисьмо") И
		Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок") 
	Тогда
		Объект.ПлановыйИсполнитель = ОбщегоНазначения.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТелефонЗаконномуПредставителю(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаконныйПредставитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставитель");
		Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
			// Определяем существующий номер телефона представителя
			Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
				СтарыйНомерТелефона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставительТелефон");
			Иначе
				СтарыйНомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ЗаконныйПредставитель,
					ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСотовый"),,Ложь);
			КонецЕсли;
			Если СтарыйНомерТелефона <> Объект.НомерТелефона Тогда
				Если НЕ ЗначениеЗаполнено(СтарыйНомерТелефона) Тогда
					Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
						ЗаписатьТелефонЗаконномуПредставителюНаСервере(Объект.Клиент, ЗаконныйПредставитель, Объект.НомерТелефона);
					Иначе
						ПараметрыФормы = Новый Структура("Клиент, Номер", ЗаконныйПредставитель, Объект.НомерТелефона);
						ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));
					КонецЕсли;
				Иначе
					ПараметрыФормы = Новый Структура("Клиент, Номер", ЗаконныйПредставитель, Объект.НомерТелефона);
					ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));	
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный номер уже содержится в списке номеров законного представителя (" + Строка(ЗаконныйПредставитель) + ")");		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПослеИзмененияНомера(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
	ОбновитьПодсказкуНомераТелефона();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность() Экспорт
	
	МожноПланировать = (Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящееПисьмо") И
		Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок"));
	ЭтоЗвонок = (Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок") Или
		Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ИсходящийЗвонок"));	
	
	Элементы.ДатаПлан.Доступность = МожноПланировать;
	Элементы.ДатаПланВремя.Доступность = Элементы.ДатаПлан.Доступность;
	Элементы.ПлановыйИсполнитель.Доступность = МожноПланировать;
	Элементы.Цель.Доступность = МожноПланировать;
	
	Элементы.ВидСобытия.Доступность = Не Объект.СозданАвтоматически;
	
	// Звонки
	Элементы.ГруппаЗвонок.Доступность = ЭтоЗвонок;
	Элементы.ФормаНачатьРазговор.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр И Не Объект.ЗвонокНачат;
	Элементы.ФормаНачатьРазговорМонитор.Доступность = Элементы.ФормаНачатьРазговор.Доступность;	
	Элементы.ДлительностьВремя.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр;
	
	// Phone
	Элементы.бит_НабранныйНомер.Видимость = Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок");
	
	Длительность = Дата(1,1,1) + Объект.ДлительностьЗвонка;
	
	Элементы.ИсходЗвонка.АвтоОтметкаНезаполненного = ТипыЗвонкаСОбязательнымИсходом.НайтиПоЗначению(Объект.ТипЗвонка) <> Неопределено;
	
	Элементы.Обращение.Доступность = Не ЗначениеЗаполнено(Объект.Основание);
	Элементы.Основание.Доступность = Не ЗначениеЗаполнено(Объект.ИсточникИнформации);
	
	Элементы.Обращение.Заголовок = ?(ЗначениеЗаполнено(Объект.ИсточникИнформации), "Обращение (" + Строка(Объект.ИсточникИнформации) + ")", "Обращение");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСотовыйТелефонУКлиента(Клиент)
	
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Запись.Объект = Клиент;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Запись.Прочитать();
	
	Возврат Запись.Выбран();
	
КонецФункции

&НаКлиенте
Процедура ДатаФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаФакт) И Не ЗначениеЗаполнено(Объект.ФактическийИсполнитель) Тогда
		Объект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаРасширеннаяПодсказкаНажатие(Элемент)
	Объект.НомерТелефона = Элемент.Заголовок;
	ОбновитьПодсказкуНомераТелефона();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсказкуНомераТелефона()
	ТелефонныйНомерВБазе = ПолучитьНомерАвтоподстановки();
	
	Если НЕ ЗначениеЗаполнено(Объект.НомерТелефона) И ЗначениеЗаполнено(ТелефонныйНомерВБазе) Тогда
		Элементы.НомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Элементы.НомерТелефонаРасширеннаяПодсказка.Заголовок = ТелефонныйНомерВБазе;
	Иначе
		Элементы.НомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	ОбновитьКэшНомеровКлиента();
	ОбновитьПримечаниеТелефонногоНомера();
	ОбновитьДоступностьСохраненияНомераЗаконномуПредставителю();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	ОбновитьПодсказкуНомераТелефона();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКэшНомеровКлиента()
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТелефоныКлиента = КонтактнаяИнформацияСерверПереопределяемый.ПолучитьТелефоныВладельца(Объект.Клиент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПримечаниеТелефонногоНомера()
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерТелефона) Тогда
		ТекущийНомерНормализованный = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(Объект.НомерТелефона).Номер;
	Иначе
		ТекущийНомерНормализованный = Неопределено;
	КонецЕсли;
	
	НомерАвтоподстановки = ПолучитьНомерАвтоподстановки();
	Если ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
		НомерАвтоподстановкиНормализованный = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(НомерАвтоподстановки).Номер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийНомерНормализованный) Тогда 
		Если НомерАвтоподстановкиНормализованный = ТекущийНомерНормализованный Тогда
			// Итак выбран самый основной телефон, дополнительной информации выводить не требуется	
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = "";
		Иначе
			НомерЧислитсяВБазе = Ложь;
			ВидТекущегоНомера = Неопределено;
			
			Для Каждого ДанныеНомера Из ТелефоныКлиента Цикл
				НомерТелефонаНормализованный = 	КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(ДанныеНомера.Представление).Номер;
				Если НомерТелефонаНормализованный = ТекущийНомерНормализованный Тогда
					НомерЧислитсяВБазе = Истина;
					ВидТекущегоНомера = ДанныеНомера.Вид;
				КонецЕсли;
				
			КонецЦикла;
			Если НЕ НомерЧислитсяВБазе Тогда
				Если Не ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Текущий номер телефона не зарегистрирован в базе.'");
				Иначе
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru=Текущий номер телефона не зарегистрирован в базе, но имеется номер для связи:'") + " " + Строка(НомерАвтоподстановки);
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
					// Такого по не должно быть, т.к. любой номер имеющийся в базе должен найтись при поиске 
				Иначе
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Текущий номер телефона зарегистрирован в базе, но имеется отличный от него номер для связи:'") + " " + Строка(НомерАвтоподстановки);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;		
	Иначе
		Если ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='У клиента имеется заполненный основной телефон. Кликните по подсказке снизу.'");
		Иначе
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Нет данных о каких-либо номерах телефонов.'");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНомерАвтоподстановки()
	Возврат КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Объект.Клиент,,,,Ложь);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьТелефонЗаконномуПредставителюНаСервере(Клиент, ЗаконныйПредставитель, НомерТелефона)
	Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
		КлиентОбъект = Клиент.ПолучитьОбъект();
		КлиентОбъект.ЗаконныйПредставительТелефон = НомерТелефона;
		КлиентОбъект.Записать();
	Иначе
		КонтактнаяИнформацияСерверПереопределяемый.ЗаписатьНомерТелефона(ЗаконныйПредставитель, НомерТелефона);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСохраненияНомераЗаконномуПредставителю()
	ДоступностьКнопки = Ложь;	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаконныйПредставитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставитель");
		Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
			ДоступностьКнопки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЗаписатьТелефонЗаконномуПредставителю.Доступность = ДоступностьКнопки;
КонецПроцедуры

&НаКлиенте
Процедура ТипЗвонкаПриИзменении(Элемент)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИсходЗвонкаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтсутствуютЛистыОжиданияВведенныеНаОсновании(Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистОжидания.Ссылка
		|ИЗ
		|	Документ.ЛистОжидания КАК ЛистОжидания
		|ГДЕ
		|	ЛистОжидания.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Событие);
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура ИсходЗвонкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсходЗвонкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИсходЗвонка) И Не ЗначениеЗаполнено(Объект.ТипЗвонка) Тогда
		СтрокиТиповЗвонковПоИсходуЗвонка = ИсходыПоТипуЗвонка.НайтиСтроки(Новый Структура("ИсходЗвонка", Объект.ИсходЗвонка));
		Если СтрокиТиповЗвонковПоИсходуЗвонка.Количество() = 1 Тогда
			Объект.ТипЗвонка = СтрокиТиповЗвонковПоИсходуЗвонка[0].ТипЗвонка;  	
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтрокиИсходовПоТипуЗвонка = ИсходыПоТипуЗвонка.НайтиСтроки(Новый Структура("ТипЗвонка", Объект.ТипЗвонка));
	
	Если СтрокиИсходовПоТипуЗвонка.Количество() = 0 Тогда
		СтандартнаяОбработка = Истина;
	Иначе
		Для Каждого СтрокаТаблицы Из СтрокиИсходовПоТипуЗвонка Цикл
			ДанныеВыбора.Добавить(СтрокаТаблицы.ИсходЗвонка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаКлиенте
Процедура UTM_SOURCEПриИзменении(Элемент)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьКомментарииКлиента(Клиент, ДекорацияПодсказкаКлиента, СтраницыКомментарий, СтраницаКнопка, СтраникаГиперссылка)
	
	ЕстьКомментарий = Ложь;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		КомментарииКлиента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Клиент, "Комментарий, КраткийКомментарий");
		ПодсказкаКомментарии = СокрЛП(КомментарииКлиента.КраткийКомментарий);
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ПодсказкаКомментарии, КомментарииКлиента.Комментарий, "; ", Истина);
		ПодсказкаКомментарии = СтрЗаменить(ПодсказкаКомментарии, Символы.ПС, "¶");
	Иначе
		ПодсказкаКомментарии = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПодсказкаКомментарии) Тогда
		СтраницыКомментарий.ТекущаяСтраница = СтраницаКнопка;
	Иначе
		СтраницыКомментарий.ТекущаяСтраница = СтраникаГиперссылка;
		ДекорацияПодсказкаКлиента.Заголовок = ПодсказкаКомментарии;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомментарииКлиентаПослеИзменения(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодсказкаКлиентаНажатие(Элемент)
	ОткрытьКомментарийКлиента(Неопределено);
КонецПроцедуры
